garyPenhook/PyAvrOCD/svd/avr128da28s.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VPORTF</name>
      <description>Virtual Ports</description>
      <baseAddress>0x00800014</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR</name>
          <description>Data Direction</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>IN</name>
          <description>Input Value</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>Pin Interrupt Flag</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT</name>
          <description>Output Value</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VREF</name>
      <description>Voltage reference</description>
      <baseAddress>0x008000A0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACREF</name>
          <description>AC Reference</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V024</name>
                  <description>Internal 1.024V reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V048</name>
                  <description>Internal 2.048V reference</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V096</name>
                  <description>Internal 4.096V reference</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V500</name>
                  <description>Internal 2.500V reference</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>VDD as reference</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFA</name>
                  <description>External reference on VREFA pin</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALWAYSON</name>
              <description>Always on</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC0REF</name>
          <description>ADC0 Reference</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V024</name>
                  <description>Internal 1.024V reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V048</name>
                  <description>Internal 2.048V reference</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V096</name>
                  <description>Internal 4.096V reference</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V500</name>
                  <description>Internal 2.500V reference</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>VDD as reference</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFA</name>
                  <description>External reference on VREFA pin</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALWAYSON</name>
              <description>Always on</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC0REF</name>
          <description>DAC0 Reference</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V024</name>
                  <description>Internal 1.024V reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V048</name>
                  <description>Internal 2.048V reference</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V096</name>
                  <description>Internal 4.096V reference</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V500</name>
                  <description>Internal 2.500V reference</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>VDD as reference</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFA</name>
                  <description>External reference on VREFA pin</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALWAYSON</name>
              <description>Always on</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
